Autodesk.Revit.DB.FamilyElementVisibility.IsShownInFine
Indicates if the instance is display with Fine detail level in the view
of project document.
Remarks: This property cannot be set to false if the other two detail levels are also false.

Autodesk.Revit.DB.FamilyElementVisibility.IsShownInMedium
Indicates if the instance is display with Medium detail level in the view
of project document.
Remarks: This property cannot be set to false if the other two detail levels are also false.

Autodesk.Revit.DB.FamilyElementVisibility.IsShownInCoarse
Indicates if the instance is display with Coarse detail level in the view
of project document.
Remarks: This property cannot be set to false if the other two detail levels are also false.

Autodesk.Revit.DB.FamilyElementVisibility.IsShownInLeftRight
Indicates if the instance is display in Left/Right view of project document.
Remarks: This property matters for objects whose visibility type is Model.

Autodesk.Revit.DB.FamilyElementVisibility.IsShownInFrontBack
Indicates if the instance is display in Front/Back view of project document.
Remarks: This property matters for objects whose visibility type is Model.

Autodesk.Revit.DB.FamilyElementVisibility.IsShownInTopBottom
Indicates if the instance is display in Plan/RCP view of project document.
Remarks: This property matters for objects whose visibility type is Model.

Autodesk.Revit.DB.FamilyElementVisibility.IsShownInPlanRCPCut
Indicates if the instance is displayed when cut in Plan/RCP (if the category permits).
Remarks: controls whether the Model Family Element is shown when a FamilyInstance
of that Family is cut in a Plan/RCP view, i.e. the cut plane passes through the
bounding box of the instance. It only has a meaning  for categories that are "cut in the symbol". For
non-cuttable categories it is always false and for ones that are "cuttable in the
instance" it is the same as the IsShownInTopBottom.

Autodesk.Revit.DB.FamilyElementVisibility.IsShownOnlyWhenCut
Indicates if the instance is displayed only if it has been cut.
Remarks: This property matters for objects which visibility type is ViewSpecific.

Autodesk.Revit.DB.FamilyElementVisibility.VisibilityType
Indicates if the instance is Model or View specific.

Autodesk.Revit.DB.FamilyElementVisibility
Provides access to the visibility parameters of family elements in family document.